from .models import Poster
from datetime import datetime


p1 = Poster(title='БОЛЬШОЙ СОЛЬНЫЙ КОНЦЕРТ ВИА ВОЛГА-ВОЛГА',
            creator='Салакаев Антон Викторович',
            place='Максимилианс - Клубный ресторан',
            price=1000,
            short_description='Дудки, гармонь, гитары, барабаны — адепт придуманного им «волжского расколбаса»...',
            full_description='Дудки, гармонь, гитары, барабаны — адепт придуманного им «волжского расколбаса», ВИА «Волга-Волга» 16 ноября дает большой сольный концерт в Самаре!\n\nСтилистическое направление музыканты определяют как ска-фолк-рок-бардак и приправляют его легким городским романсом .\n\nВ программе концерта - авторские хиты из нового альбома группы и самые забойные каверы.\n\nТанцевать будут все!\n\nВ 2022 году группа отметила 25-летие. Сегодн я «Волга-Волга» дает более 150 концертов в год, участвует в знаковых музыкальных фестивалях и масштабных проектах страны, ежегодно организует и проводит собственныйодноименный музыкальный фестиваль.\n\nПесни «Волги-Волги» находятся в ротации на федеральных радиостанциях, звучат в фильмах и сериалах.\n\nОснователь и солист группы — Антон Салакаев.',
            time_event=datetime(2024, 10, 30, 15, 30),
            preview_image='poster1_preview.webp',
            background_image='poster1_background.webp')

p2 = Poster(title='Жениться Вам надо, барин',
            creator='Туголуков Игорь Олегович',
            place='Самарская государственная филармония',
            price=1800,
            short_description='По мотивам повести Н. Некрасова «Осенняя скука»',
            full_description='Действие спектакля происходит в поместье. За окном стужа и темень. До ближайшей усадьбы несколько вёрст. Скука и осенняя тоска одолевают барина Ласукова ежедневно. Он спит весь день, а по вечерам, не зная, чем себя занять, заставляет слуг развлекать его, изображая то цыган с бубном, то петухов на утренней заре и вообще всё, что ему в голову взбредёт. \n\nПодобные вечера случаются практически каждый день. Слуги валятся с ног от усталости, и пока они, переходя от пантомимы к танцам, от игры на пианино обратно к пантомиме, мечтают об отмене крепостного права и о смерти барина одновременно, зрители смеются до слёз и аплодируют. \n\nНо в ходе спектакля становится понятно, что перед нами не просто красочный калейдоскоп скоморошества, плясок, музыкальных номеров. Спектакль выстроен по принципу контраста — в разгар веселья он призывает задуматься о достаточно серьёзных вещах. Ведь не только барин Ласуков, а многие поколения русских людей мучительно пытаются найти ответы на вопросы: «Что делать?», «Кто виноват?», «Как жить?»… \n\nЗамечательный актёрский состав, гротеск и изящно ввёрнутые режиссёром в постановку современные шутки заряжают невероятно позитивным настроением, а потрясающая импровизация актёров со зрительным залом позволяет почувствовать себя частью происходящего на сцене.',
            time_event=datetime(2024, 11, 26, 19, 00),
            preview_image='poster2_preview.webp',
            background_image='poster2_background.webp'
            )

p3 = Poster(title='Кипелов',
            creator='ООО "Артисты и Звёзды"',
            place='СКК "Дворец Спорта имени Владимира Высоцкого"',
            price=2000,
            short_description='«Кипелов» — российская рок-группа под руководством Валерия Кипелова',
            full_description='«Кипелов» — российская рок-группа под руководством Валерия Кипелова, основанная в 2002 году. По словам Валерия, группа играет в стиле Хард-н-хеви, а главные ориентиры в творчестве — это «хорошая красивая мелодия и достойный текст». \n\nЛауреат премии «MTV Russia Music Awards» 2004 года как лучший рок-проект. \n\nВ дискографии коллектива семь студийных лонгплеев, пять лайв-релизов, среди достижений - разнообразные номинации и премии: «Чартова дюжина», «Русский топ», «MTV Russia Music Awards», «Золотой венец Победы» и многие другие. «Кипелов» — частый гость фестивалей «Нашествие», «Рок над Волгой», «Славянский базар», «Тамань» и других. Это одна из наиболее успешных в России рок-групп. В настоящее время музыканты активно выступают, принимают участие в крупнейших рок-фестивалях.',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster3_preview.webp',
            background_image='poster3_background.webp'
            )

p4 = Poster(title='Любэ',
            creator='ООО «Л-Бюро»',
            place='Самарская государственная филармония',
            price=3500,
            short_description='Группа была основана в 1989-м году И. Матвиенко и Н. Расторгуевым.',
            full_description='Группа была основана в 1989-м году И. Матвиенко и Н. Расторгуевым. Идея создания группы принадлежала композитору Игорю Матвиенко, а своё странное название получила с лёгкой руки Николая Расторгуева(жаргонное словечко из детства Николая, означающее «разный» , «любой» и тп).\n\nЖанр, в котором существует Любэ трудно определить, хотя, его вполне можно назвать - «Фолк-Рок». А социально-патриотическая направленность прослеживается на протяжении всего творческого пути группы.\nХарактерной особенностью Любэ является невероятное количество хитов - песен, которые стали поистине народными:\nАтас, Не валяй дурака, Америка, Конь, Там за туманами, Берёзы, Позови меня тихо по имени, Комбат, Давай за, и много-много других - это песни, которые прошли испытание временем и, популярны по сей день!\n\nЗа 30 с лишним лет группа Любэ дала невероятное количество концертов. Живые выступления группы за эти годы увидели миллионы зрителей в России и за рубежом и сопровождались неизменными аншлагами! Следует отметить, что группа с первого своего появления, мгновенно стала популярной. Песни, написанные Игорем Матвиенко вместе поэтами Александром Шагановым и Михаилом Андреевым , практически, все стали хитами; неповторимый тембр Николая Расторгуева; узнаваемый, характерный стиль аранжировок; уникальное общее звучания группы; наличие хоров во многих произведениях, только подчёркивающие самобытность Любэ - вот это всё, наверно, и объясняет невероятный успех, популярность и любовь зрителя многие годы?!\n\n\nВот уже 30 с лишним лет прошло со дня появления Любэ на сцене, третье поколение зрителей приходит на концерты группы - потому что песни группы Любэ не потеряли своей своей актуальности, привлекательности по сей день!!!',
            time_event=datetime(2024, 11, 5, 19, 00),
            preview_image='poster4_preview.webp',
            background_image='poster4_background.webp'
            )

p5 = Poster(title='Юмористическое шоу команды города Пятигорск',
            creator='ООО КОМАНДА Б',
            place='КРЦ Звезда',
            price=1800,
            short_description='Долгожданное событие, гастрольный тур одной из самых ярких команд...',
            full_description='Долгожданное событие, гастрольный тур одной из самых ярких команд в сетке телевизионного вещания, среди юмористических программ, главного канала страны.\n\nКоманда города Пятигорск начала свой путь в 2009 году. Участие в играх межрегиональной лиги, в Краснодаре, что укрепило веру в собственные силы участников команды, что уже в 2011 году позволило выиграть бронзу Высшей лиги. В 2013 году команда становится Чемпионом Высшей лиги параллельно собрав всех больших Кивинов. Дважды побеждала в летних кубках чемпионов.\n\nОдна из самых титулованных команд за всю историю Российского юмора.\n\nКоманда много лет неизменна в своем составе:\nОльга Картункова\nЕкатерина Моргунова\nВладислав Хелоян\nАртур Диланян\nТатьяна Винокурова\nМаксим Киселев\nАнтон Остерников\nАлександр Савченко\nЗаурбек Байцаев\n\nОдна из самых поющих команд покажет свои лучшие эфирные номера и выступления, которые вы могли видеть в проектах Первого канала, в проектах «Игра» и «Концерты» на канале ТНТ.\n\nВ данный момент участники коллектива активно продолжают свое триумфальное шествие в составе команды а так же принимают участие в записи шоу как на телевидении, так на просторах интернета, снимаются в кино и сериалах.',
            time_event=datetime(2024, 11, 9, 19, 00),
            preview_image='poster5_preview.webp',
            background_image='poster5_background.webp'
            )

p6 = Poster(title='Big Baby Tape',
            creator='Big Baby Tape',
            place='Метелица-С',
            price=2190,
            short_description='Для вас выступит самый ожидаемый артиста отечественной реп-индустрии — Big Baby Tape',
            full_description='Мероприятие клубного формата. Артист выходит на сцену не ранее 20:00 и является не единственным элементом ночной программы.\n\nДля вас выступит самый ожидаемый артиста отечественной реп-индустрии — Big Baby Tape. Егор максимально продуктивно провёл последний год, выпустив два успешных альбома, треки из которых висят в топах чартов. Теперь время услышать новый звук и лучшие хиты артиста вживую.',
            time_event=datetime(2024, 10, 27, 18, 00),
            preview_image='poster6_preview.webp',
            background_image='poster6_background.webp'
            )

p7 = Poster(title='Cinema Medley: Hans Zimmer’s Universe',
            creator='Imperial Orchestra',
            place='СКК Дворец спорта',
            price=2200,
            short_description='Грандиозное шоу саундтреков от симфонического оркестра Imperial Orchestra',
            full_description='Hans Zimmer’s Universe — это трибьют великому композитору, ставшему легендой современного кинематографа.\n\nХанс Циммер — главное имя в современном музыкальном мире Голливуда. Композитор, написавший музыку к более чем 200 фильмам, обладатель премий «Оскар», «Грэмми» и «Золотой глобус».\n\nВ фильмографию композитора вошли самые известные блокбастеры и мультфильмы нашего времени: «Интерстеллар», «Гладиатор», «Король Лев», «Пираты Карибского моря», «Начало», «Последний Самурай», «Дюна» и многие другие.\n\nШоу Hans Zimmer’s Universe — это невероятный взрыв энергии, света и музыки в исполнении большого симфонического оркестра Imperial Orchestra, хора, органа и виртуозных солистов. Настоящий подарок для ценителей творчества композитора и всех любителей кино. Шоу саундтреков — это уникальный шанс погрузиться в атмосферу любимых фильмов и вновь пережить незабываемые эмоции.\n\nHans Zimmer’s Universe — симфоническое шоу от создателей нашумевшего проекта Cinema Medley, шоу, которое уже увидели сотни тысяч зрителей, а теперь и можете увидеть вы!\n\nImperial Orchestra — большой симфонический оркестр и хор, который объединил виртуозов Санкт-Петербурга и Москвы. Оркестр был создан в 2021 году специально для шоу Cinema Medley и за несколько лет стал главным кино-оркестром России! В репертуаре оркестра музыка из 80 фильмов, написанная петербургским композитором-аранжировщиком Дмитрием Кошелевым в жанре Medley — симфоническая фантазия или сюита. В настоящий момент в состав оркестра входя свыше 200 артистов, 2 дирижера, а также команда звукоинженеров и художников по свету, которые делают каждое шоу уникальным. Свыше 150000 зрителей уже побывали на наших шоу, 10млн. просмотров видео в социальных сетях делают Imperial Orchestra одним из самых популярных современных оркестров России и СНГ.',
            time_event=datetime(2024, 11, 28, 19, 00),
            preview_image='poster7_preview.webp',
            background_image='poster7_background.webp'
            )

p8 = Poster(title='Шоу воды, огня и света',
            creator='Цирк Анатолия Сокола / Росгосцирк',
            place='Цирк им. Олега Попова',
            price=1000,
            short_description='Российская государственная цирковая компания представляет крупномасштабное цирковое «Шоу воды, огня и света!»',
            full_description='Российская государственная цирковая компания представляет крупномасштабное цирковое «Шоу воды, огня и света!» под руководством заслуженного артиста России Анатолия Сокола!\n\nСозвездие талантливых артистов разнообразных жанров — обладателей самых престижных премий мира, дарит зрителям завораживающее дух шоу, наполненное яркими красками современных световых технологий, загадками истинной магии цирка, демонстрацией феноменальных способностей экзотических животных и слиянием двух стихий — воды и огня, рождаемых из самого сердца манежа!\n\nВ «Шоу воды, огня и света!» брошен вызов законам природы. Вы увидите головокружительные трюки за гранью реальности и человеческих возможностей. Наше шоу — результат смелой фантазии, колоссального труда, преданности профессии и искренней любви к искусству цирка.\n\nПродолжительность шоу 2 часа 30 минут. С 1 антрактом.',
            time_event=datetime(2024, 11, 2, 18, 00),
            preview_image='poster8_preview.webp',
            background_image='poster8_background.webp'
            )

p9 = Poster(title='MAYOT',
            creator='MAYOT',
            place='Метелица-С',
            price=2099,
            short_description='Сольный концерт MAYOT в твоем городе, все главные хиты, а также новые треки.',
            full_description='Сольный концерт MAYOT в твоем городе, все главные хиты, а также новые треки.\n\nНачало мероприятия в 18:00. Артисты выходят на сцену не ранее 20:00.\n\nМы советуем вам приходить в удобное для вас время, чтобы вы не стояли в очереди на входе и комфортно прошли на мероприятие.\n\nКлуб вправе отказать вам во входе, в случае несоблюдения основных правил посещения: возрастных ограничений, состояния алкогольного или наркотического опьянения.',
            time_event=datetime(2024, 12, 1, 18, 00),
            preview_image='poster9_preview.webp',
            background_image='poster9_background.webp'
            )

p10 = Poster(title='Сергей Лазарев Шоу «Я не боюсь!»',
            creator='Сергей Лазарев',
            place='СКК Дворец спорта',
            price=2000,
            short_description='Сергей Лазарев вновь выступит со своим шоу «Я не боюсь».',
            full_description='Один из самых гастролирующих артистов российской эстрады, талантливый певец Сергей Лазарев вскоре снова порадует поклонников грандиозным концертным шоу «Я не боюсь!».\n\nПремьера концертного шоу «Я не боюсь!» состоялась осенью 2022 года. С того момента певец успел показать его своим поклонникам уже более 150 раз. По версии RU.TV, эта программа стала лучшим концертным сольным шоу.\n\nЗрителей ждут масштабные декорации, уникальные танцевальные постановки, красочные костюмы, невероятный свет, живой звук, яркие спецэффекты, любимые хиты, музыкальные новинки и мощная энергетика артиста.\n\nНе пропустите грандиозное событие в своем городе!',
            time_event=datetime(2025, 2, 27, 19, 00),
            preview_image='poster10_preview.webp',
            background_image='poster10_background.webp'
            )

p11 = Poster(title='Илья Авербух «Щелкунчик»',
            creator='Илья Авербух',
            place='СКК Дворец Спорта',
            price=1200,
            short_description='Самое успешное и зрелищное новогоднее шоу страны!',
            full_description='Масштабные декорации! Спецэффекты на льду!\nЗвездный состав Олимпийских чемпионов! Огромный состав участников!\n\n28 декабря в городе Самара состоится самое масштабное, зрелищное и любимое новогоднее ледовое шоу Ильи Авербуха по мотивам сказки Гофмана «Щелкунчик и Мышиный король».\n\nМасштабные декорации воссоздадут уникальную атмосферу любимой всеми сказки «Щелкунчик». Постановщик шоу - самый успешный продюсер ледовых проектов нашей страны Илья Авербух.\n\nБилет на это шоу станет идеальным подарком для всех членов семьи. Ведь этот спектакль создан для того, чтобы удивлять публику и дарить ей счастье вне зависимости от возраста.\n\nБезупречное мастерство и актерский талант известных фигуристов - Олимпийских чемпионов, воздушных гимнастов, ловких акробатов, а также яркие костюмы, масштабные декорации и невероятные спецэффекты с живым огнем создают настоящее волшебство на ледовом поле!\n\nГлавные роли в спектакле исполнят звезды фигурного катания мира и нашей страны, Олимпийские чемпионы Алексей Ягудин, Татьяна Тотьмянина, Максим Маринин, а также Артем Федорченко и многие другие.\n\nНе пропустите самое зрелищное новогоднее шоу страны!\nЛегендарное ледовое шоу для всей семьи «Щелкунчик и Мышиный король».',
            time_event=datetime(2024, 12, 28, 19, 00),
            preview_image='poster11_preview.webp',
            background_image='poster11_background.webp'
            )

p12 = Poster(title='mzlff',
            creator='mzlff',
            place='Сигнал',
            price=1500,
            short_description='Быть взрослым — значит, уметь понять в первую очередь себя.',
            full_description='Быть взрослым — значит, уметь понять в первую очередь себя. Взрослый знает, кто он, что он хочет, как этого достичь, и действует самостоятельно, полагаясь только на себя. Наша концертная банда уже прошла и отрочество и беззаботную юность, и теперь мы сила, которую уже ничего не остановит.\n\nВзрослый — это тот, кто несёт на себе ответственность за свои желания и знает, что никто за него самого их не исполнит. Мое главное желание сейчас — презентовать вам свой новый альбом, свой новый взгляд на музыку и на жизнь в целом. Старые хиты + новая программа, всё на высшем уровне.',
            time_event=datetime(2024, 12, 22, 19, 00),
            preview_image='poster12_preview.webp',
            background_image='poster12_background.webp'
            )

p13 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster13_preview.webp',
            background_image='poster13_background.webp'
            )

p14 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster14_preview.webp',
            background_image='poster14_background.webp'
            )

p15 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster15_preview.webp',
            background_image='poster15_background.webp'
            )

p16 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster16_preview.webp',
            background_image='poster16_background.webp'
            )

p17 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster17_preview.webp',
            background_image='poster17_background.webp'
            )

p18 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster18_preview.webp',
            background_image='poster18_background.webp'
            )

p19 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster19_preview.webp',
            background_image='poster19_background.webp'
            )

p20 = Poster(title='',
            creator='',
            place='',
            price=0,
            short_description='',
            full_description='',
            time_event=datetime(2024, 11, 1, 19, 00),
            preview_image='poster20_preview.webp',
            background_image='poster20_background.webp'
            )
